#include <stdio.h>

int main()
{
	printf("123\n");
	printf("1\n2\n3\n");
	printf("1\n\t2\n\t\t3\n");
	printf("%4d\n\t%8d\n\t\t%12d\n\t\t\t%16d\n", 1, 2, 3, 4);
	printf("%10.3f\n ", 12.234657);
	printf("%10.5f\n ", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Деление %d на %d равно %.1f\n", 7, 5, 7. / 5);
	printf("Умножение %d на %d равно %d\n", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000);
	printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
	printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
	printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);
}